import { Speech } from '@/types/speech';

let baseUrlPathname = '';

const speeches: Speech[] = [
  {
    title: '배움의 자세',
    message: `
    IT는 1분 1초가 다르게 발전하고 있으며 새로운 패러다임이 일어나고 기존에 있던 도구들도 계속 업데이트 되고 있습니다.
    이렇게 빠르게 변하는 IT 분야에 적응하려면 협력과 배움의 자세를 갖는 것이 중요합니다. 항상 겸손해야 하고 타인을 존중하고 모든 것에서 배울 점을 찾아야 합니다.
    또한 저는 컴퓨터 엔지니어로서 혼자 IT 서비스를 출시하고 유지보수 할 수 있을 만큼의 능력을 갖춰야 한다고 생각했습니다.
    저는 흥미있는 IT 스킬이라면 무엇이든지 배울 준비가 되어있었고 웹/앱/서버/데이터 관련 분야들을 모두 경험했습니다.
    서로 다른 주제의 IT 스킬을 익히기 위해 개념의 충돌과 한계에 부딪혔고 그 한계를 넘어왔습니다. 그래서 저는 한계 상황에 익숙합니다. 언제나 새로운 기술을 익힐 준비가 되어 있으며 폭넓은 실무지식을 바탕으로 어떤 분야든 참여할 수 있습니다.
    `,
  },
];

export default speeches;
