import { Speech } from '@/types/speech';

const speeches: Speech[] = [
  {
    title: '배움의 자세',
    message: [
      'IT는 1분 1초가 다르게 발전하고 있으며 새로운 패러다임이 일어나고 기존에 있던 도구들도 계속 업데이트 되고 있습니다.',
      '이렇게 빠르게 변하는 IT 분야에 적응하려면 협력과 배움의 자세를 갖는 것이 중요합니다. 항상 겸손해야 하고 타인을 존중하고 모든 것에서 배울 점을 찾아야 합니다.',
      '또한 저는 컴퓨터 엔지니어로서 혼자 IT 서비스를 출시하고 유지보수 할 수 있을 만큼의 능력을 갖춰야 한다고 생각했습니다.',
      '저는 흥미있는 IT 스킬이라면 무엇이든지 배울 준비가 되어있었고 웹/앱/서버/데이터 관련 분야들을 모두 경험했습니다.',
      '서로 다른 주제의 IT 스킬을 익히기 위해 개념의 충돌과 한계에 부딪혔고 그 한계를 넘어왔습니다. 그래서 저는 한계 상황에 익숙합니다. 언제나 새로운 기술을 익힐 준비가 되어 있으며 폭넓은 실무지식을 바탕으로 어떤 분야든 참여할 수 있습니다.',
    ],
  },
  {
    title: '문제해결능력은 뚜렷한 목적의식과 끈기에서 온다',
    message: [
      '저는 문제해결력이 우수하며 끈기있는 사람입니다. 업무에서 중요한 요소 중 하나는 결론적으로 “문제를 해결했는가? 하지 못했는가?” 입니다.',
      '저는 업무가 주어지면 그 업무의 완료까지 다른 것은 모두 잊고 해당 분야에 몸과 마음을 모두 바쳐 몰두합니다. 통계학 전공인 만큼 높은 수학적 이해도와, 끈기, 꼼꼼함을 바탕으로 문제에 접근합니다.',
      '어려운 업무가 주어지면 난관에 부딪히고 심적 부담이 커지기 마련이지만 절대 굴하지 않고 도전할 수 있습니다. 노는 시간을 줄이고 잠자는 시간을 줄여서라도 제게 주어진 업무에 책임을 지고 끝까지 완수해낼 수 있습니다. 그런 어려움이야말로 나를 성장시키기 때문입니다.',
      '초기 스타트업에 근무하는 동안 오전 10시 기상, 업무 수행 후, 새벽 4시 취침이라는 극한의 상황을 1년 반 가량 지속했습니다. 이는 휴게시간을 제외하고 일 평균 근무시간이 12시간 이상이 됩니다.  매일 그동안 겪어보지 못한 문제들을 해결해야 했습니다.  신체적으로, 정신적으로 매우 힘든 시기였지만 주어진 문제를 해결하겠다는 뚜렷한 목적의식과 끈기로 업무를 완수해냈습니다.',
      '그리고 이러한 경험은 노력한다면 무엇이든 해결해낼 수 있다는 것을 증명해 주었습니다.',
    ],
  },
  {
    title: '나의 초능력 = 꼼꼼함',
    message: [
      '저는 수백 페이지의 문서에서 글머리기호 하나에만 글꼴 굵음 처리가 잘못 들어가 있는 것을 발견할 만큼 매우 꼼꼼합니다. ' +
        '제가 문서를 보면 남들은 발견하지 못하는 오탈자를 발견하는 일이 많습니다. 이 때문에 문서 작업을 많이 담당했었습니다.',
      '개발 할 때에도 매우 꼼꼼히 코드를 작성합니다. 어설프게 작성한 코드는 당장 문제를 해결한 것 같지만 ' +
        '이후에 더 큰 유지비용을 발생시킬 수도 있습니다. 따라서 저는 팀 협업과 재사용성, 확장성을 고려하여 짜임새 있는 구조로 코드를 작성합니다.',
    ],
  },
];

export default speeches;
